In [1]:
import numpy as np
import pandas as pd
from pandas import Series, DataFrame
from numpy.random import randn

In [3]:
ind = "A B C D E".split()
cols = "col1 col2 col3 col4 col5".split()
x = []
for i in range(25):
    x.append( np.random.randint( 1, 100 ) )
x = np.array( x )
x = x.reshape(5,5)
df = DataFrame( x, index=ind, columns=cols )
df

   col1  col2  col3  col4  col5
A    93    25    69    76    88
B    44    18    69    56    27
C    84    33    43     3    15
D    87    83    82     3    21
E    39    10    65     8    22

In [5]:
new_ind = "A B C D E F G".split()
df = df.reindex( new_ind, fill_value = 0 )
df

   col1  col2  col3  col4  col5
A    93    25    69    76    88
B    44    18    69    56    27
C    84    33    43     3    15
D    87    83    82     3    21
E    39    10    65     8    22
F     0     0     0     0     0
G     0     0     0     0     0

In [6]:
new_cols = "col1 col2 col3 col4 col5 col6".split()
df = df.reindex( columns=new_cols, fill_value = 0 )
df

   col1  col2  col3  col4  col5  col6
A    93    25    69    76    88     0
B    44    18    69    56    27     0
C    84    33    43     3    15     0
D    87    83    82     3    21     0
E    39    10    65     8    22     0
F     0     0     0     0     0     0
G     0     0     0     0     0     0

In [7]:
df.ix['E']

col1    39
col2    10
col3    65
col4     8
col5    22
col6     0
Name: E, dtype: int64

In [8]:
df.drop('F')

   col1  col2  col3  col4  col5  col6
A    93    25    69    76    88     0
B    44    18    69    56    27     0
C    84    33    43     3    15     0
D    87    83    82     3    21     0
E    39    10    65     8    22     0
G     0     0     0     0     0     0

In [9]:
df.drop('col5', axis=1)

   col1  col2  col3  col4  col6
A    93    25    69    76     0
B    44    18    69    56     0
C    84    33    43     3     0
D    87    83    82     3     0
E    39    10    65     8     0
F     0     0     0     0     0
G     0     0     0     0     0

In [10]:
df.sum()

col1    347
col2    169
col3    328
col4    146
col5    173
col6      0
dtype: int64

In [11]:
df.sum(axis=1)

A    351
B    214
C    178
D    276
E    144
F      0
G      0
dtype: int64

In [12]:
df.max()

col1    93
col2    83
col3    82
col4    76
col5    88
col6     0
dtype: int64

In [13]:
df.idxmax()

col1    A
col2    D
col3    D
col4    A
col5    A
col6    A
dtype: object

In [17]:
df[df==0] = np.nan
df[df<10] = np.nan
df

   col1  col2  col3  col4  col5  col6
A    93    25    69    76    88   NaN
B    44    18    69    56    27   NaN
C    84    33    43   NaN    15   NaN
D    87    83    82   NaN    21   NaN
E    39    10    65   NaN    22   NaN
F   NaN   NaN   NaN   NaN   NaN   NaN
G   NaN   NaN   NaN   NaN   NaN   NaN

In [18]:
df.dropna(how='all')

   col1  col2  col3  col4  col5  col6
A    93    25    69    76    88   NaN
B    44    18    69    56    27   NaN
C    84    33    43   NaN    15   NaN
D    87    83    82   NaN    21   NaN
E    39    10    65   NaN    22   NaN

In [25]:
df.dropna(thresh=5)

   col1  col2  col3  col4  col5  col6
A    93    25    69    76    88   NaN
B    44    18    69    56    27   NaN

In [29]:
df.fillna(0, inplace=True)
df

   col1  col2  col3  col4  col5  col6
A    93    25    69    76    88     0
B    44    18    69    56    27     0
C    84    33    43     0    15     0
D    87    83    82     0    21     0
E    39    10    65     0    22     0
F     0     0     0     0     0     0
G     0     0     0     0     0     0

# Getting Stock Prices from Yahoo

In [31]:
import pandas.io.data as pdweb
import datetime as dt
prices = pdweb.get_data_yahoo(['AAPL', 'NFLX'], start=dt.datetime(2015, 1,1),
                              end=dt.datetime(2015,9,30))['Adj Close']
prices.head()

                  AAPL       NFLX
Date
2015-01-02  106.918237  49.848572
2015-01-05  103.906178  47.311428
2015-01-06  103.915960  46.501427
2015-01-07  105.373089  46.742859
2015-01-08  109.421762  47.779999